import sys
def обрахунок_зп(години: float, ставка: float, норма: float, множник=1.5):
    if години < 0 or ставка < 0:
        # print(f"Години та ставка не можуть бути відʼємними ({години=}, {ставка=})")
        return None
    if години <= норма:
        зарплата = години * ставка
    else:
        час_понад_норми = години - норма
        зарплата_понад_норми = час_понад_норми*ставка*множник
        зарплата = норма * ставка + зарплата_понад_норми
    return зарплата
def main():
    # try:
    #     години = float(input("Введіть години: "))
    #     ставка = float(input("Введіть ставку: "))
    # except:
    #     print(f"Введено некоректні дані")
    #     sys.exit()
    # норма = 40
    assert обрахунок_зп(-1, 1, 40) == None
    assert обрахунок_зп(0, 1, 40) == 0
    assert обрахунок_зп(40, 1, 32) == 44
    assert обрахунок_зп(10, 1, 40) == 10
    assert обрахунок_зп(40, 2, 40) == 80
    assert обрахунок_зп(45, 2, 40) == 95
    # print(f"Ваша зарплатня за тиждень складає {зарплата} грн ({години=}, {ставка=})")

main()